Revit 2027 API
ContourSetting.AddSingleContour Method
 Add a single contour as a contour setting item to the current contour setting.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ContourSettingItem AddSingleContour(
	double elevation,
	ElementId subcategoryId
)
Public Function AddSingleContour (
	elevation As Double,
	subcategoryId As ElementId
) As ContourSettingItem
public:
ContourSettingItem^ AddSingleContour(
	double elevation,
	ElementId^ subcategoryId
)
member AddSingleContour :
        elevation : float *
        subcategoryId : ElementId -> ContourSettingItem
Parameters
elevation Double
 The contour elevation.
subcategoryId ElementId
 The contour line style subcategory id.
Return Value
ContourSettingItem
 The newly added contour setting item.
Exceptions
Exception | Condition
ArgumentException |  The given value for elevation is not finite
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ContourSetting Class
Autodesk.Revit.DB Namespace